{
  "article":{
    "title":"Don't use CSS!",
    "text1":"CSS was a game changer on the internet and is getting better every year, but with it, people also are creating new tools to help us with CSS, so today use pure CSS is basically a wast of time. ",
    "text2":"So why content creators use pure CSS?",
    "text2-1":" Well, they aren't wrong and on their shoes I would probably do the same, that is because the are making general content about CSS, so it's easy for all the viewers understand pure CSS than some frameworks that people never saw before. That doesn't mean that on they regular jobs they don't use frameworks or preprocessors, since this tolls can bring a lot of benefits, definitelly they use. ",
    "text3":"With preprocessors like Sass or Less, we can separate and import code from different files, this really helps on the maintance and reading of the code. We can split all the CSS in modules and create a modular and organized structure. Also we won time wen writing the code, we can take shortcuts and later the preprocessor will adjust everything into normal CSS for us. ",
    "text4":"Furthermore, we also have frameworks, like Bootstrap and Tailwind, that I personally don't like, but also can safe you so much time. With Bootstrap all websites looks the same because the focus is on standardization and Tailwind don't make us learning CSS, everyone I know that uses Tailwind pick classes almost randonly, until one is right, so this don't make you know CSS, this makes you know how to use a tool, but as a programmer, that is what you want?. ",
    "text5":"CSS is amazing and I believe that learning it allow us to have more unique designs and well, isn't hard! Almost everything that you need to do in normal websites you can do the structure with one, two or three lines of code, only two or three words per line. You only have to divide your problem into small pieces. It's like the traffic, if you imagine the traffic of the center of a big city, lots of cars comes from this side, lots of cars from the other sides, some motorcycles in between with different speed, it's insane! But if you drive, you know that all of this doesn't matter, you need to pay attention basically on the direct cars that are around you (foward, behind, left and right) and the mirrors for the plus like motorcycles. CSS is a lot of small pieces, do one at a time and you will be fine.",
    "emphasis":"Sass vs Less",
    "text6":"Just to be clear, if you don't learn anything about Sass or Less yet, I wanna say that all that I say about learning CSS to be unique it's still true when you are using preprocessors, they will just make your productivity growth, but you will still write all the CSS.",
    "text7":"I suggest that you look at both and try to make association with the projects you work. Sass is more popular and have more resources, so we maybe can say that this is the best preprocessor on the market, but Less have a sintaxe more similar to CSS, so it's easy to learn and also will improve a lot of your productivity. If you are a beginner on front-end, I highly recommended Less, at least for now. If you are more familiarized with CSS and overall programming, Sass can serve you better, since have more resources and a bigger community to help you.",
    "text8":"I hope that you have enjoyed this small introduction about preprocessors and CSS frameworks, pick the one that you like more, but never forget to study the pure CSS, everything comes from there!",
    "footer":"Renato Magnus 17/11/23"
  }
}