{
  "article":{
    "title":"How To Study and Consume Programming Contents",
    "text1":"When I started programming, I think: \"I will go deep on this, be surrounded by tech subjects 24/7 and I will learn faster and better than others Jr's that some how compete with me\".",
    "text2":"Damn, I was totally wrong. Listen to a podcast or youtube video while we clean our house isn't study! Doesn't matter if I watch 3 hours of content, I wasn't paying attention, but this type of action will give the sensation that I have completed my studies for today.",
    "text3":"When I reallized all that, I stopped immediatly. For example: when I go to the shower now, is time to relax, reestart my brain for my studies that will happen after the shower. Before, I shower listenning to podcasts and don't have the willing to hard study after, cause my brain was always tired.",
    "text4":"In the same time, one thing that I always listen in this contents was that we learn from practice. So I challenged my self: \"can I READ contents from blogs and forums, and practice personal projects literally every day besides work?\"",
    "text5":"The word read is highlighted because we need to read and not watch content, while we are studying. When we watch or (worst) just listen content, we don't pay attention as we should. And don't came to me saying \"I always pay attention in two or three things, I'm used to it\", cause you aren't, X-men. You can do two things at same time, but you need to realize and assume to yourself that you are always giving up one for the other.",
    "text6":"After accepted my own challenge, I saw my contributions on Github happen more frequently, my learning curve has improved, I could start this blog and work more on my personal projects. This makes me very happy, I think that now I'm on the right way, just need keep going, consistently.",
    "text7":"Well, I still watch youtube videos, tech content, but not exactly what I need to study. I understand that this videos are only for entertainment and for me be always more familiar with english and tech topics overall. So my original plan of the beginning of my journey as a developer still happen, I am surrounder by tech subjects 24/7, but it's very divided on my head when I'm studying (seriously) or when I'm working out or cleaning the house, we're I listen to some podcast or a random youtube video from a dev channel.",
    "text8":"So start your own projects, focus on your studies. Realize that your future depends on your present and if you like programming and are in the beginning of your carrer, you should know that even working on the area, in five years you can still be considered a jr developer, or a mediocre mid-level with low payment, and is that what you really want for yourself five years from know?",
    "text9": "Make mistakes, use or don't use pomodoro or any other miraculous method, since you sit on your chair and try to study focused, without watch social medias every 5 minutes, the results will come. Just stop make excuses for yourself, you are the only harmed with it.",
    "footer":"Renato Magnus 11/14/23"
  }
}